{"keras_version": "2.3.1", "backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "name": "dense_1_input", "config": {"sparse": false, "name": "dense_1_input", "batch_input_shape": [null, 5000], "dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["dense_1_input", 0, 0, {}]]], "name": "dense_1", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "linear", "units": 512, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_constraint": null, "batch_input_shape": [null, 5000], "dtype": "float32"}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "leaky_re_lu_1", "config": {"trainable": true, "name": "leaky_re_lu_1", "dtype": "float32", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "dense_2", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "linear", "kernel_regularizer": null, "units": 200, "name": "dense_2", "kernel_constraint": null, "bias_constraint": null, "dtype": "float32"}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "leaky_re_lu_2", "config": {"trainable": true, "name": "leaky_re_lu_2", "dtype": "float32", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}], "name": "model_3", "output_layers": [["leaky_re_lu_2", 0, 0]], "input_layers": [["dense_1_input", 0, 0]]}, "class_name": "Model"}