{"backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "name": "dense_1_input", "config": {"batch_input_shape": [null, 5000], "name": "dense_1_input", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Dense", "name": "dense_1", "config": {"activation": "linear", "dtype": "float32", "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "batch_input_shape": [null, 5000], "trainable": true, "name": "dense_1", "activity_regularizer": null}, "inbound_nodes": [[["dense_1_input", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_1", "config": {"trainable": true, "name": "leaky_re_lu_1", "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"activation": "linear", "dtype": "float32", "units": 200, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "name": "dense_2", "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_2", "config": {"trainable": true, "name": "leaky_re_lu_2", "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "name": "model_1", "output_layers": [["leaky_re_lu_2", 0, 0]], "input_layers": [["dense_1_input", 0, 0]]}, "keras_version": "2.3.1"}