{"keras_version": "2.3.1", "config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 5000], "name": "dense_1_input"}, "inbound_nodes": [], "name": "dense_1_input", "class_name": "InputLayer"}, {"config": {"units": 512, "name": "dense_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 5000], "activity_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null}, "inbound_nodes": [[["dense_1_input", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_1", "alpha": 0.10000000149011612}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "leaky_re_lu_1", "class_name": "LeakyReLU"}, {"config": {"units": 200, "name": "dense_2", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}, {"config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_2", "alpha": 0.10000000149011612}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "leaky_re_lu_2", "class_name": "LeakyReLU"}], "input_layers": [["dense_1_input", 0, 0]], "name": "model_1", "output_layers": [["leaky_re_lu_2", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}